/*
 * SPDX-License-Identifier: GPL-3.0-or-later
 *  ____  ___ ____  _____
 * |  _ \|_ _/ ___|| ____|
 * | |_) || |\___ \|  _|
 * |  _ < | | ___) | |___
 * |_| \_\___|____/|_____|
 *
 * Copyright (C) 2026 Dmitry Starushko <dmitry.starushko@gmail.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 */

#include "zxula.h"

/*///----------------------------------------------

Время проходит, придет и прощаться пора.
Знаю, не всех это так уж и слишком обрадует...
Знать бы, что дальше -- на мёрзлом погосте дыра,
А может быть, радуга?
Может быть -- радуга?!

Я не надеюсь на райские кущи никак,
Впрочем, и ада, мне кажется, тоже не стою я.
Вдруг я шагну -- а вокруг только копоть да мрак?
Вот будет история!
Вот так история...

Крайне не хочется _так_ это мне узнавать,
Лучше б, конечно, спросить у свидетелей праведных...
Лучше-то лучше, да только вот -- где же их взять?
При этих-то правилах...
Этих-то правилах...

Нет здесь морали, и смысла особого нет,
Просто обидно вдруг взять и исчезнуть навечно мне...
Что же до выводов: боженьке стоит иметь
Хоть чуть человечности!
Чуть человечности...

Время проходит, придет и прощаться пора.
Знаю, не всех это так уж и слишком обрадует...
Знать бы, что дальше -- на мёрзлом погосте дыра,
А может быть, радуга?
Всё-таки -- радуга?...

*///-----------------------------------------------
